res/files/local-mysysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 10 tps: 21.19 qps: 430.55 (r/w/o: 302.50/84.77/43.29) lat (ms,95%): 759.88 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 10 tps: 22.40 qps: 455.46 (r/w/o: 319.44/91.11/44.91) lat (ms,95%): 694.45 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 10 tps: 25.19 qps: 499.26 (r/w/o: 349.63/99.25/50.38) lat (ms,95%): 530.08 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 10 tps: 23.51 qps: 471.44 (r/w/o: 329.57/94.85/47.02) lat (ms,95%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 10 tps: 19.10 qps: 383.46 (r/w/o: 268.47/76.79/38.20) lat (ms,95%): 816.63 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 10 tps: 22.39 qps: 442.92 (r/w/o: 309.47/88.66/44.78) lat (ms,95%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 10 tps: 21.31 qps: 425.92 (r/w/o: 298.35/85.14/42.42) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 10 tps: 18.19 qps: 369.62 (r/w/o: 259.18/73.86/36.58) lat (ms,95%): 787.74 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 10 tps: 17.11 qps: 342.66 (r/w/o: 239.51/69.03/34.12) lat (ms,95%): 893.56 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 10 tps: 20.80 qps: 414.65 (r/w/o: 291.37/81.59/41.70) lat (ms,95%): 694.45 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 10 tps: 22.60 qps: 449.00 (r/w/o: 313.60/90.30/45.10) lat (ms,95%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 10 tps: 25.00 qps: 495.95 (r/w/o: 346.03/99.81/50.10) lat (ms,95%): 590.56 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            36372
        write:                           10392
        other:                           5196
        total:                           51960
    transactions:                        2598   (21.56 per sec.)
    queries:                             51960  (431.13 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.5195s
    total number of events:              2598

Latency (ms):
         min:                                  181.88
         avg:                                  463.26
         max:                                 1084.22
         95th percentile:                      719.92
         sum:                              1203547.73

Threads fairness:
    events (avg/stddev):           259.8000/2.60
    execution time (avg/stddev):   120.3548/0.09