res/files/remote-mysysbench.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 10
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 10 tps: 73.76 qps: 1493.78 (r/w/o: 1046.63/298.64/148.52) lat (ms,95%): 350.33 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 10 tps: 64.91 qps: 1287.13 (r/w/o: 900.99/256.32/129.81) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 10 tps: 70.00 qps: 1411.34 (r/w/o: 987.66/283.69/139.99) lat (ms,95%): 411.96 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 10 tps: 71.40 qps: 1427.55 (r/w/o: 999.57/285.19/142.80) lat (ms,95%): 390.30 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 10 tps: 71.21 qps: 1420.92 (r/w/o: 994.78/283.72/142.41) lat (ms,95%): 390.30 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 10 tps: 69.40 qps: 1390.69 (r/w/o: 973.59/278.30/138.80) lat (ms,95%): 383.33 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 10 tps: 79.60 qps: 1592.03 (r/w/o: 1114.45/318.39/159.19) lat (ms,95%): 344.08 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 10 tps: 83.80 qps: 1670.47 (r/w/o: 1170.05/332.81/167.61) lat (ms,95%): 369.77 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 10 tps: 72.50 qps: 1456.35 (r/w/o: 1018.17/293.19/145.00) lat (ms,95%): 397.39 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 10 tps: 83.10 qps: 1657.09 (r/w/o: 1160.49/330.40/166.20) lat (ms,95%): 411.96 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 10 tps: 87.60 qps: 1755.70 (r/w/o: 1229.20/351.30/175.20) lat (ms,95%): 331.91 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 10 tps: 68.50 qps: 1370.81 (r/w/o: 959.11/274.70/137.00) lat (ms,95%): 397.39 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            125552
        write:                           35872
        other:                           17936
        total:                           179360
    transactions:                        8968   (74.54 per sec.)
    queries:                             179360 (1490.70 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.3180s
    total number of events:              8968

Latency (ms):
         min:                                   36.81
         avg:                                  133.91
         max:                                  788.42
         95th percentile:                      376.49
         sum:                              1200926.35

Threads fairness:
    events (avg/stddev):           896.8000/5.44
    execution time (avg/stddev):   120.0926/0.08